kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_dmac.c
        iomem_free(dmac_context[channel_num].dest_malloc);
        dmac_context[channel_num].dest_malloc = NULL;
        dmac_context[channel_num].dest_buffer = NULL;
        dmac_context[channel_num].buf_len = 0;
    }
    if(dmac_context[channel_num].src_malloc)
    {
        iomem_free(dmac_context[channel_num].src_malloc);
        dmac_context[channel_num].src_malloc = NULL;
    }
#endif
}

int dmac_is_idle(dmac_channel_number_t channel_num)
{
    dmac_chen_u_t chen;
    chen.data = readq(&dmac->chen);
    if((chen.data >> channel_num) & 0x1UL)
        return 0;
    else
        return 1;
}

void dmac_wait_idle(dmac_channel_number_t channel_num)
{
    while(!dmac_is_idle(channel_num))
        ;
    dmac_channel_interrupt_clear(channel_num); /* clear interrupt */
}

void dmac_set_src_dest_length(dmac_channel_number_t channel_num, const void *src, void *dest, size_t len)
{
    if(src != NULL)
        dmac->channel[channel_num].sar = (uint64_t)src;
    if(dest != NULL)
        dmac->channel[channel_num].dar = (uint64_t)dest;
    if(len > 0)
        dmac_set_block_ts(channel_num, len - 1);
    dmac_channel_enable(channel_num);
}

static int dmac_irq_callback(void *ctx)
{
    dmac_context_t *v_dmac_context = (dmac_context_t *)(ctx);
    dmac_channel_number_t v_dmac_channel = v_dmac_context->dmac_channel;
    dmac_channel_interrupt_clear(v_dmac_channel);
#if FIX_CACHE
    if(v_dmac_context->dest_buffer)
    {
        memcpy(v_dmac_context->dest_buffer, v_dmac_context->dest_malloc, v_dmac_context->buf_len);
        iomem_free(v_dmac_context->dest_malloc);
        v_dmac_context->dest_malloc = NULL;
        v_dmac_context->dest_buffer = NULL;
        v_dmac_context->buf_len = 0;
    }
    if(v_dmac_context->src_malloc)
    {
        iomem_free(v_dmac_context->src_malloc);
        v_dmac_context->src_malloc = NULL;
    }
#endif

    if(v_dmac_context->callback != NULL)
        v_dmac_context->callback(v_dmac_context->ctx);

    return 0;
}

void dmac_irq_register(dmac_channel_number_t channel_num, plic_irq_callback_t dmac_callback, void *ctx, uint32_t priority)
{
    dmac_context[channel_num].dmac_channel = channel_num;
    dmac_context[channel_num].callback = dmac_callback;
    dmac_context[channel_num].ctx = ctx;
    dmac_enable_channel_interrupt(channel_num);
    plic_set_priority(IRQN_DMA0_INTERRUPT + channel_num, priority);
    plic_irq_register(IRQN_DMA0_INTERRUPT + channel_num, dmac_irq_callback, &dmac_context[channel_num]);
    plic_irq_enable(IRQN_DMA0_INTERRUPT + channel_num);
}

void dmac_irq_unregister(dmac_channel_number_t channel_num)
{
    dmac_context[channel_num].callback = NULL;
    dmac_context[channel_num].ctx = NULL;
    dmac_disable_channel_interrupt(channel_num);
    plic_irq_unregister(IRQN_DMA0_INTERRUPT + channel_num);
}
